Revit 2027 API
BuiltInFailures.MassFailures.NonOccupiableMassZone Property
 For mass zone, if the bottom level ref does not intersect, then this zone is going to be "not occupiable" and a warning is posted for it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonOccupiableMassZone { get; }
Public Shared ReadOnly Property NonOccupiableMassZone As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonOccupiableMassZone {
	FailureDefinitionId^ get ();
}
static member NonOccupiableMassZone : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace